//=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
//
//  < fpack >
//   2004 ASTROLL Inc. All Rights Reserved.
//--------------------------------------------------------------
//
//	雑多な処理
//
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
//  $Id: misc.h,v 1.1.1.1 2004/02/09 08:13:36 nishi Exp $
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=

//==============================================================
#ifndef _MISC_H_
#define _MISC_H_
//==============================================================

/********************************************/
/*             定数・マクロ宣言             */
/********************************************/
// 指定値で切り上げ(a : 入力  b : 基準値)
//----------------------------------------
#define CEILING(a, b)  (((a) % (b)) ? (a) + (b) - ((a) % (b)) : (a))

// ファイルパス長の文字列コピー(必ずコピー先の終端に '\0' を入れる)
//---------------------------------------------------
#define PATHCOPY(dst, src)  strCopyLength(dst, FNAME_MAXLEN, src)


/********************************************/
/*                構造体宣言                */
/********************************************/


/********************************************/
/*              グローバル変数              */
/********************************************/


/********************************************/
/*              グローバル関数              */
/********************************************/
extern void strCopyLength(char *dst, int len, const char *src);
extern void putvalue(unsigned char *p, int a);
extern int getvalue(unsigned char *p);
extern int fileExist(char *file);
extern int getFileSize(char *file);
extern int getLine(FILE *ifp, char *top, int lim);
extern char **separateString(char *in, char *ss, char *ns, int *cnt);
extern void freeStringList(char **top);
extern char *copyText(const char *text);
extern void freeText(char *text);


//==============================================================
#endif
//==============================================================

