//
//	キー文字列 15bytes 限定のハッシュ関数
//

/*

	HASH_KEYMODULO は素数を指定する。
	256		251
	512		509
	1024	1021
	2048	2039
	4096	4093

*/

#include "co_hash16.h"
#include "co_debug.h"
#include "co_memory.h"
#include "co_strings.h"
#include "co_objlink.h"


#define HASH_KEYNUM     512						// 最大キー数
#define HASH_KEYMODULO  509


struct _sHASH_KEY {
	char id_str[ID_MAXLEN];							// 文字列
	void *ptr;										// 値
	sHASH_KEY *next;								// 次のキーへのポインタ(衝突用)
};

struct _sHASH {
	char id_str[ID_MAXLEN];							// 識別子

	sHASH_KEY *key_tbl[HASH_KEYNUM];
	sLink *key_link;

	int key_num;									// 登録数
	int collis_num;									// 衝突数
};


//==============================================================
static u_int hashMake(char *s)
//--------------------------------------------------------------
// 文字列から固有のインデックスを取得
// ※Wikipedia参照
//--------------------------------------------------------------
// in:	s = 文字列
//--------------------------------------------------------------
// out:	インデックス
//==============================================================
{
    u_int h;

    h = 0;
    while(*s != '\0')
    {
        h = h * 137 + *s;
        s += 1;
    }

    return h % HASH_KEYMODULO;
}

//==============================================================
static sHASH_KEY *hashSearch(sHASH *hash, u_int index, char *id_str)
//--------------------------------------------------------------
// 登録されているか検索
//--------------------------------------------------------------
// in:	hash   = ハンドル
//		index  = インデックス
//		id_str = 文字列
//--------------------------------------------------------------
// out:	登録されているポインタ(NULL = 未登録)
//==============================================================
{
	sHASH_KEY *key;

	key = *(hash->key_tbl + index);
	while(key)
	{
		if(!strcmp(key->id_str, id_str))	break;
		key = key->next;
	}

	return key;
}

//==============================================================
static sHASH_KEY *hashAddKey(sHASH *hash, u_int index)
//--------------------------------------------------------------
// キーの新規作成
//--------------------------------------------------------------
// in:	hash  = ハンドル
//		index = インデックス
//--------------------------------------------------------------
// out:	生成したキー
//==============================================================
{
	sHASH_KEY *key;
	sHASH_KEY *last;

	key = (sHASH_KEY *)ObjLinkNew(hash->key_link);			// ワーク取得
	ASSERT(key);
	last = *(hash->key_tbl + index);
	if(last == NULL)
	{
		// 先頭に追加
		*(hash->key_tbl + index) = key;
	}
	else
	{
		// 最後尾に追加
		while(last->next)
		{
			last = last->next;
		}
		last->next = key;

		hash->collis_num += 1;
	}
	hash->key_num += 1;

	return key;
}

//==============================================================
static void hashDelKey(sHASH *hash, sHASH_KEY *key, u_int index)
//--------------------------------------------------------------
// キーの削除
//--------------------------------------------------------------
// in:	hash  = ハンドル
//		key   = キー
//		index = インデックス
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	sHASH_KEY *prev = NULL;
	sHASH_KEY *p;

	p = *(hash->key_tbl + index);
	while(p != key)
	{
		prev = p;
		p = p->next;
	}

	if(!prev)
	{
		// 先頭
		*(hash->key_tbl + index) = key->next;
		if(key->next)	hash->collis_num--;
	}
	else
	{
		// 途中
		prev->next = key->next;
		hash->collis_num--;
	}
	ObjLinkDel(hash->key_link, key);
	hash->key_num--;
}

//==============================================================
sHASH *HashCreate(char *id_str)
//--------------------------------------------------------------
// 生成
//--------------------------------------------------------------
// in:	id_str = 識別子(デバッグ用)
//--------------------------------------------------------------
// out:	ハンドル
//==============================================================
{
	sHASH *hash;

	hash = (sHASH *)GetWork(sizeof(sHASH), id_str);
	STRCPY16(hash->id_str, id_str);
	hash->key_link = ObjLinkCreate(sizeof(sHASH_KEY), HASH_KEYNUM, MEM_APP, FALSE);

	return hash;
}

//==============================================================
void HashKill(sHASH *hash)
//--------------------------------------------------------------
// 破棄
//--------------------------------------------------------------
// in:	hash = ハンドル
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	ObjLinkDestroy(hash->key_link);
	Free(hash);
}

//==============================================================
void HashCleanup(sHASH *hash)
//--------------------------------------------------------------
// 消去
//--------------------------------------------------------------
// in:	hash = ハンドル
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
//	ZEROMEMORY(hash->key_tbl, sizeof(sHASH_KEY *) * HASH_KEYNUM);
	ZEROMEMORY(hash->key_tbl, sizeof(hash->key_tbl));
	ObjLinkDelAll(hash->key_link);
	hash->key_num = 0;
	hash->collis_num = 0;
}

//==============================================================
void HashAdd(sHASH *hash, char *id_str, void *ptr)
//--------------------------------------------------------------
// 登録
// NULL の登録は不可
//--------------------------------------------------------------
// in:	hash   = ハンドル
//		id_str = 識別子
//		ptr    = 登録値
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	char str[ID_MAXLEN];
	u_int index;
	sHASH_KEY *key;

	ASSERT(ptr);

	STRCPY16(str, id_str);						// 15bytes まで
	index = hashMake(str);						// インデックス取得
	key = hashSearch(hash, index, str);			// 検索
	if(!key)
	{
		key = hashAddKey(hash, index);			// キー生成
		strcpy(key->id_str, str);
		key->ptr = ptr;
	}
}

//==============================================================
void *HashGet(sHASH *hash, char *id_str)
//--------------------------------------------------------------
// 取得
//--------------------------------------------------------------
// in:	hash   = ハンドル
//		id_str = 識別子
//--------------------------------------------------------------
// out:	登録値(NULL = データ無し)
//==============================================================
{
	char str[ID_MAXLEN];
	u_int index;
	sHASH_KEY *key;
	void *res = NULL;

	STRCPY16(str, id_str);						// 15bytes まで
	index = hashMake(str);						// インデックス取得
	key = hashSearch(hash, index, str);			// 検索
	if(key)		res = key->ptr;

	return res;
}

//==============================================================
void HashDel(sHASH *hash, char *id_str)
//--------------------------------------------------------------
// 削除
//--------------------------------------------------------------
// in:	hash   = ハンドル
//		id_str = 識別子
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	char str[ID_MAXLEN];
	u_int index;
	sHASH_KEY *key;

	STRCPY16(str, id_str);						// 15bytes まで
	index = hashMake(str);						// インデックス取得
	key = hashSearch(hash, index, str);			// 検索
	if(key)		hashDelKey(hash, key, index);
}

//==============================================================
int HashGetKeyNum(sHASH *hash)
//--------------------------------------------------------------
// 登録数を取得
//--------------------------------------------------------------
// in:	hash = ハンドル
//--------------------------------------------------------------
// out:	登録数
//==============================================================
{
	return hash->key_num;
}

//==============================================================
int HashGetCollision(sHASH *hash)
//--------------------------------------------------------------
// 衝突数を取得
//--------------------------------------------------------------
// in:	hash = ハンドル
//--------------------------------------------------------------
// out:	衝突数
//==============================================================
{
	return hash->collis_num;
}

//==============================================================
sHASH_KEY **HashGetKeyList(sHASH *hash)
//--------------------------------------------------------------
// 登録リストを作成
// ※リストは Free() で開放
//--------------------------------------------------------------
// in:	hash = ハンドル
//--------------------------------------------------------------
// out:	作成したリスト
//==============================================================
{
	sHASH_KEY **list;
	int i;
	sHASH_KEY *key;

	list = (sHASH_KEY **)GetWork(sizeof(sHASH_KEY *) * (hash->key_num + 1), "hash_list");
	key = (sHASH_KEY *)ObjLinkGetTop(hash->key_link);
	for(i = 0; i < hash->key_num; ++i)
	{
		*(list + i) = key;
		key = (sHASH_KEY *)ObjLinkGetNext(key);
	}

	return list;
}

//==============================================================
char *HashGetKeyId(sHASH_KEY *key)
//--------------------------------------------------------------
// キーのIDを取得
//--------------------------------------------------------------
// in:	key = キー
//--------------------------------------------------------------
// out:	登録文字列
//==============================================================
{
	return key->id_str;
}

//==============================================================
void *HashGetKeyValue(sHASH_KEY *key)
//--------------------------------------------------------------
// キーの登録内容を取得
//--------------------------------------------------------------
// in:	key = キー
//--------------------------------------------------------------
// out:	登録内容
//==============================================================
{
	return key->ptr;
}

