
/*

	アプリケーション内でやり取りされるメッセージ群をまとめて定義

*/

//==============================================================
#ifndef CO_MESSAGE_H
#define CO_MESSAGE_H
//==============================================================
#ifdef __cplusplus
extern              "C"
{
#endif


/********************************************/
/*             定数・マクロ宣言             */
/********************************************/
enum enmMSG {
	MSG_NULL	= 0,							// ヌルメッセージ

	//------------------------------------------
	// 基本メッセージ (必ず処理するメッセージ)
	//------------------------------------------
	MSG_CREATE,									// 生成
	MSG_KILL,									// 消滅
	//--------------------------
	MSG_PREPROC,								// 前処理
	MSG_STEP,									// １フレーム進める
	MSG_UPDATE,									// 更新
	MSG_DRAW,									// 描画
	//--------------------------
	MSG_PAUSE,									// ポーズ(lParam = TRUE: ポーズ開始)
	MSG_RELOAD,									// 再読み込み(パラメータなどをできる限り読み込み直す)

	//------------------------------------------
	// 汎用オブジェクト
	//------------------------------------------
	MSG_OBJ,
	MSG_OBJ_END = MSG_OBJ + 100,

	//------------------------------------------
	// ゲーム中のメッセージ
	//------------------------------------------
	MSG_GAME,
	MSG_GAME_END = MSG_GAME + 100,

	//------------------------------------------
	// ※追加方法は、以下の要領で。
	//
	// 1. enmMSG に追加
	//
	//    MSG_FILEIO,
	//    MSG_FILEIO_END = MSG_FILEIO + 50,
	//
	// 2. 自分のソース内で、
	//
	//    enum enmMSG_FILEIO {
	//        MSG_FILEIO_OPEN = MSG_FILEIO,
	//        MSG_FILEIO_READ,
	//        MSG_FILEIO_CLOSE,
	//    };
	//
	//    こんな感じで宣言して使う。
	//------------------------------------------

};

#ifdef __cplusplus
}
#endif
//==============================================================
#endif
//==============================================================

