
#include "co_task.h"
#include "co_debug.h"
#include "co_objlink.h"
#include "co_strings.h"
#include "co_memory.h"


struct _sTaskBody {
	int prio;									// プライオリティ
	u_int flag;									// 動作フラグ
	int sleep_time;								// スリープ時間(0 = 無限)
	void *var;									// 汎用データポインタ
	char name[ID_MAXLEN];						// タスク名
	TASK_FUNC func;								// コールバック
	struct _sTaskBody *parent;					// 親タスク(NULL = 親無し)

	int lParam;									// MSG_CREATE を直ちに呼び出されない場合の引数
	int rParam;
};


static sLink *task_link;


//==============================================================
static sTaskBody *l_taskCreate(char *name, int prio, TASK_FUNC func)
//--------------------------------------------------------------
// タスク作成
//--------------------------------------------------------------
// in:	name = タスク名
//		prio = プライオリティ
//		func = コールバック
//--------------------------------------------------------------
// out:	アクセスハンドル
//==============================================================
{
	sTaskBody *body;

	body = (sTaskBody *)ObjLinkNew(task_link);
	ASSERT(body);
	STRCPY16(body->name, name);
	body->prio = prio;
	body->func = func;

	return body;
}

//==============================================================
static void l_taskDelete(sTaskBody *body)
//--------------------------------------------------------------
// タスク削除
//--------------------------------------------------------------
// in:	body = タスク
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	sTaskBody *child;

	// メッセージ送信
	TaskPostMsgChild(body, MSG_KILL, 0, 0);
	TaskPostMsg(body, MSG_KILL, 0, 0);

	// 子タスクの破棄
	child = TaskEnumChild(body, NULL);
	while(child)
	{
		sTaskBody *next;

		next = TaskEnumChild(body, child);

		FreeWork(child->var);
		ObjLinkDel(task_link, child);
		child = next;
	}

	FreeWork(body->var);
	ObjLinkDel(task_link, body);
}

//==============================================================
void TaskInit(int num)
//--------------------------------------------------------------
// 初期化
//--------------------------------------------------------------
// in:	num = 最大タスク数
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	task_link = ObjLinkCreate(sizeof(sTaskBody), num, MEM_SYS, FALSE);

	SYSINFO(".... task initialize");
}

//==============================================================
void TaskFin(void)
//--------------------------------------------------------------
// 終了
//--------------------------------------------------------------
// in:	なし
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	int i;

	// アプリケーションから終了
	// ※プライオリティの低い順に終了
	//--------------------------
	for(i = TASK_PRI_NUM; i > TASK_PRI_01; i -= 1)
	{
		TaskDeleteAll(i - 1);
	}
	// システムは最後に削除
	//--------------------------
	TaskDeleteAll(TASK_PRI_SYS);

	ObjLinkDestroy(task_link);

	SYSINFO(".... task finish");
}

//==============================================================
void TaskUpdate(int msg, BOOL pause)
//--------------------------------------------------------------
// タスク更新処理
// ※MSG_PREPROC, MSG_STEP, MSG_UPDATE 等のメッセージを処理
// ※スリープ関連もココで処理
//--------------------------------------------------------------
// in:	msg   = enmMSG
//		pause = TRUE: ポーズ状態
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	int i;
	sTaskBody *body;
	sTaskBody *next;

	// プライオリティ毎に順次メッセージを投げる
	//------------------------------------------
	for(i = TASK_PRI_SYS; i < TASK_PRI_NUM; ++i)
	{
		body = TaskGetBody(NULL, i);
		while(body)
		{
			next = TaskGetBody(body, i);		// あらかじめ次のタスクを取得しておく(処理途中で破棄される事がある)

			if(pause && !(body->flag & TASK_NOPAUSE))
			{
				goto NEXT_TASK;
			}

			// 前処理
			//----------------------------------
			if(msg == MSG_PREPROC)
			{
				if(body->flag & TASK_SLEEP_REQ)
				{
					// スリープ開始
					body->flag &= ~TASK_SLEEP_REQ;
					body->flag |= TASK_SLEEP;
				}
				else
				if((body->flag & TASK_SLEEP) && body->sleep_time)
				{
					// スリープ解除判定
					body->sleep_time--;
					if(!body->sleep_time)
					{
						body->flag &= ~TASK_SLEEP;
					}
				}

				if(body->flag & TASK_CREATE_REQ)
				{
					// タスク起動
					body->flag &= ~TASK_CREATE_REQ;
					TaskPostMsg(body, MSG_CREATE, body->lParam, body->rParam);
				}

				if(body->flag & TASK_STEP_REQ)
				{
					// ステップ予約解除
					body->flag &= ~TASK_STEP_REQ;
				}
			}

			if(!(body->flag & (TASK_SLEEP | TASK_CREATE_REQ | TASK_STEP_REQ)))
			{
				int res;

				res = TaskPostMsg(body, msg, 0, 0);
				if((msg == MSG_STEP) && res)
				{
					// MSG_STEP で TRUE を返したら削除
					//---------------------------------
					body->flag |= TASK_DELETE_REQ;
				}
			}

			if((msg == MSG_STEP) && (body->flag & TASK_DELETE_REQ))
			{
				// 安全なタイミングでタスクを削除
				l_taskDelete(body);
			}
NEXT_TASK:
			body = next;
		}
	}
}

//==============================================================
sTaskBody *TaskCreate(char *name, int prio, TASK_FUNC func, int lParam, int rParam)
//--------------------------------------------------------------
// タスク作成
// ※即時 MSG_CREATE を実行
//--------------------------------------------------------------
// in:	name   = タスク名
//		func   = コールバック
//		lParam = パラメータ１
//		rParam = パラメータ２
//--------------------------------------------------------------
// out:	アクセスハンドル
//==============================================================
{
	sTaskBody *body;

	body = l_taskCreate(name, prio, func);
	TaskPostMsg(body, MSG_CREATE, lParam, rParam);
	body->flag |= TASK_STEP_REQ;				// 次のメインループから更新用メッセージを受け取る

	return body;
}

//==============================================================
sTaskBody *TaskEntry(char *name, int prio, TASK_FUNC func, int lParam, int rParam)
//--------------------------------------------------------------
// タスク作成
// ※MSG_CREATE は後で実行
//--------------------------------------------------------------
// in:	name   = タスク名
//		func   = コールバック
//		lParam = パラメータ１
//		rParam = パラメータ２
//--------------------------------------------------------------
// out:	アクセスハンドル
//==============================================================
{
	sTaskBody *body;

	body = l_taskCreate(name, prio, func);
	body->flag |= TASK_CREATE_REQ;
	body->lParam = lParam;
	body->rParam = rParam;

	return body;
}

//==============================================================
sTaskBody *TaskGetBody(sTaskBody *body, int prio)
//--------------------------------------------------------------
// タスク取得
//--------------------------------------------------------------
// in:	body = タスク(NULL = 先頭から)
//		prio = 対象プライオリティ(TASK_PRI_NONE = 全対象)
//--------------------------------------------------------------
// out:	次のタスク実体(NULL = 無し)
//==============================================================
{
	sTaskBody *obj;

	obj = body ? (sTaskBody *)ObjLinkGetNext(body) : (sTaskBody *)ObjLinkGetTop(task_link);
	while(obj)
	{
		if((prio ==  TASK_PRI_NONE) || (prio == obj->prio))	break;
		obj = (sTaskBody *)ObjLinkGetNext(obj);
	}

	return obj;
}

//==============================================================
sTaskBody *TaskGetBodyFromName(sTaskBody *body, char *id_str)
//--------------------------------------------------------------
// タスク取得(名前で調べる)
//--------------------------------------------------------------
// in:	body   = タスク(NULL = 先頭から)
//		id_str = タスク名
//--------------------------------------------------------------
// out:	次のタスク実体(NULL = 無し)
//==============================================================
{
	sTaskBody *obj;

	obj = body ? (sTaskBody *)ObjLinkGetNext(body) : (sTaskBody *)ObjLinkGetTop(task_link);
	while(obj)
	{
		if(!strcmp(obj->name, id_str))	break;
		obj = (sTaskBody *)ObjLinkGetNext(obj);
	}

	return obj;
}

//==============================================================
int TaskGetNum(int prio)
//--------------------------------------------------------------
// タスク数を調べる
//--------------------------------------------------------------
// in:	prio = 対象プライオリティ(TASK_PRI_NONE = 全対象)
//--------------------------------------------------------------
// out:	タスク数
//==============================================================
{
	sTaskBody *body;
	int num;

	num = 0;
	body = TaskGetBody(NULL, prio);
	while(body)
	{
		++num;
		body = TaskGetBody(body, prio);
	}

	return num;
}

//==============================================================
void *TaskGetVar(sTaskBody *body, int size, int area)
//--------------------------------------------------------------
// 汎用データポインタの取得
// ※存在しない場合は自動的に生成
//--------------------------------------------------------------
// in:	body = タスク
//		size = ワークサイズ
//		area = 確保エリア
//--------------------------------------------------------------
// out:	汎用データポインタ
//==============================================================
{
	if(!body->var && (size > 0))
	{
		char id_str[ID_MAXLEN * 2];

		sprintf(id_str, "Var:%s", body->name);
		body->var = MemMalloc(area, size, id_str);
		ASSERT(body->var);
		if(body->var)	ZEROMEMORY(body->var, size);
	}

	return body->var;
}

//==============================================================
int TaskPostMsg(sTaskBody *body, int msg, int lParam, int rParam)
//--------------------------------------------------------------
// メッセージ送信
// ※生成予約されているタスクにはメッセージを投げない
//--------------------------------------------------------------
// in:	body   = タスク
//		msg    = メッセージ
//		lParam = パラメータ１
//		rParam = パラメータ２
//--------------------------------------------------------------
// out:	実行結果
//==============================================================
{
	int res = 0;

	if(!(body->flag & TASK_CREATE_REQ))
	{
		res = body->func(body, msg, lParam, rParam);
	}

	return res;
}

//==============================================================
void TaskPostMsgAll(int prio, int msg, int lParam, int rParam)
//--------------------------------------------------------------
// 全タスクへメッセージ送信
//--------------------------------------------------------------
// in:	prio   = プライオリティ(TASK_PRI_NONE = 全対象)
//		msg    = メッセージ
//		lParam = パラメータ１
//		rParam = パラメータ２
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	sTaskBody *body = NULL;

	while((body = TaskGetBody(body, prio)) != NULL)
	{
		TaskPostMsg(body, msg, lParam, rParam);
	}
}

//==============================================================
void TaskPostMsgChild(sTaskBody *parent, int msg, int lParam, int rParam)
//--------------------------------------------------------------
// 子タスクへメッセージ送信
//--------------------------------------------------------------
// in:	parent = 親タスク
//		msg    = メッセージ
//		lParam = パラメータ１
//		rParam = パラメータ２
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	sTaskBody *body = NULL;

	do
	{
		body = TaskEnumChild(parent, body);
		if(body)
		{
			TaskPostMsg(body, msg, lParam, rParam);
		}
	}
	while(body);
}

//==============================================================
void TaskDeleteReq(sTaskBody *body)
//--------------------------------------------------------------
// タスク削除予約
//--------------------------------------------------------------
// in:	body = タスク
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	body->flag |= TASK_DELETE_REQ;
}

//==============================================================
void TaskDeleteAllReq(int prio)
//--------------------------------------------------------------
// タスク削除予約
//--------------------------------------------------------------
// in:	prio = プライオリティ
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	sTaskBody *body;

	body = (sTaskBody *)ObjLinkGetTop(task_link);
	while(body)
	{
		if((prio == TASK_PRI_NONE) || (body->prio == prio))		TaskDeleteReq(body);

		body = (sTaskBody *)ObjLinkGetNext(body);
	}
}

//==============================================================
void TaskDeleteAll(int prio)
//--------------------------------------------------------------
// 全タスク削除(即時実行)
//--------------------------------------------------------------
// in:	prio = プライオリティ
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	sTaskBody *body, *next;

	body = (sTaskBody *)ObjLinkGetTop(task_link);
	while(body)
	{
		next = (sTaskBody *)ObjLinkGetNext(body);
		if((prio == TASK_PRI_NONE) || (body->prio == prio))		l_taskDelete(body);

		body = next;
	}
}

//==============================================================
void TaskDeleteAppAll(void)
//--------------------------------------------------------------
// アプリケーションタスク削除(即時実行)
//--------------------------------------------------------------
// in:	なし
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	int i;

	for(i = TASK_PRI_01; i < TASK_PRI_NUM; ++i)
	{
		TaskDeleteAll(i);
	}
}

//==============================================================
void TaskSleepReq(sTaskBody *body, int time)
//--------------------------------------------------------------
// タスクのスリープ予約
//--------------------------------------------------------------
// in:	body = タスク
//		time = スリープ時間(0 無限)
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	body->flag |= TASK_SLEEP_REQ;
	body->sleep_time = time;
}

//==============================================================
void TaskSleep(sTaskBody *body, int time)
//--------------------------------------------------------------
// タスクのスリープ(即時実行)
//--------------------------------------------------------------
// in:	body = タスク
//		time = スリープ時間(-1 無限)
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	body->flag &= ~TASK_SLEEP_REQ;
	body->flag |= TASK_SLEEP;
	body->sleep_time = time;
}

//==============================================================
void TaskAwakeReq(sTaskBody *body, int time)
//--------------------------------------------------------------
// タスクのスリープ解除
//--------------------------------------------------------------
// in:	body = タスク
//		time = 解除時間(1 ～)
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	// この方法だと、タイミングによっては１フレームずれる
	//----------------------------------------------------
	body->sleep_time = time;
}

//==============================================================
void TaskAwake(sTaskBody *body)
//--------------------------------------------------------------
// タスクのスリープ解除(即時実行)
//--------------------------------------------------------------
// in:	body = タスク
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	body->flag &= ~(TASK_SLEEP_REQ | TASK_SLEEP);
	body->sleep_time = 0;
}

//==============================================================
BOOL TaskIsSleep(sTaskBody *body)
//--------------------------------------------------------------
// タスクがスリープ中か判別
//--------------------------------------------------------------
// in:	body = タスク
//--------------------------------------------------------------
// out:	TRUE = スリープ中
//==============================================================
{
	return (body->flag & (TASK_SLEEP_REQ | TASK_SLEEP)) ? TRUE : FALSE;
}

//==============================================================
void TaskSetNoPause(sTaskBody *body, BOOL nopause)
//--------------------------------------------------------------
// タスクがポーズに影響されるか設定
//--------------------------------------------------------------
// in:	body    = タスク
//		nopause = TRUE: ポーズに影響されない
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	if(nopause)		body->flag |= TASK_NOPAUSE;
	else			body->flag &= ~TASK_NOPAUSE;
}

//==============================================================
BOOL TaskIsNoPause(sTaskBody *body)
//--------------------------------------------------------------
// タスクがポーズに影響されるか判別
//--------------------------------------------------------------
// in:	body = タスク
//--------------------------------------------------------------
// out:	TRUE = ポーズに影響されない
//==============================================================
{
	return (body->flag & TASK_NOPAUSE) ? TRUE : FALSE;
}

//==============================================================
char *TaskGetId(sTaskBody *body)
//--------------------------------------------------------------
// 識別子取得
//--------------------------------------------------------------
// in:	body = タスク
//--------------------------------------------------------------
// out:	識別子
//==============================================================
{
	return body->name;
}

//==============================================================
void TaskSetParent(sTaskBody *body, sTaskBody *parent)
//--------------------------------------------------------------
// 親タスク設定
//--------------------------------------------------------------
// in:	body = タスク
//		parent = 親タスク(NULL = 解除)
//--------------------------------------------------------------
// out:	なし
//==============================================================
{
	ASSERT(parent != body->parent);
	body->parent = parent;
}

//==============================================================
sTaskBody *TaskGetParent(sTaskBody *body)
//--------------------------------------------------------------
// 親タスク取得
//--------------------------------------------------------------
// in:	body = タスク
//--------------------------------------------------------------
// out:	親タスク(NULL = 解除)
//==============================================================
{
	return body->parent;
}

//==============================================================
sTaskBody *TaskEnumChild(sTaskBody *parent, sTaskBody *prev)
//--------------------------------------------------------------
// 子タスクを列挙
//--------------------------------------------------------------
// in:	parent = 親タスク
//		prev   = 検索を始めるタスク(NULL = 頭から検索)
//--------------------------------------------------------------
// out:	子タスク(NULL = 無し)
//==============================================================
{
	sTaskBody *body;

	body = prev;
	do
	{
		body = body ? (sTaskBody *)ObjLinkGetNext(body) : (sTaskBody *)ObjLinkGetTop(task_link);
		if(body)
		{
			if(body->parent == parent)	break;
		}
	}
	while(body);

	return body;
}

